app/controllers/calls_controller.rb

  def index
    @calls = Call.paginate(:page => params[:page], :per_page => CALLS_PER_PAGE)
---
SELECT * FROM "calls" LIMIT 20 OFFSET 0